//#include <math.h>

//#include <iostream>
//#include <thread>
//#include <chrono>

//using namespace std;

//int main()
//{
//    //>>>----------------------------------------------------------------------------------------------------------
//    //1.确认数据类型的范围
////    uint cnt = 10;
////    chrono::milliseconds dura(2000);
////    while( cnt >=0  )//不具备跳出条件的时候编译器都会提示处警告
////    {
////        this_thread::sleep_for(dura);
////        cout << cnt <<endl;
////        cnt--;
////    }
////    cout << "跳出循环!" << endl;

//    //>>>----------------------------------------------------------------------------------------------------------
//    //2.浮点型的0值判断

//    //永远都不会进入循环
////    float pos{0.00013};
////    if(0 == pos)
////    {
////        cout << "进入循环" <<endl;
////    }

//    //正确的使用方式:指定好精度
//    float pos{0.00013};
//    if(fabs(pos-0.0)<0.0001)
//    {
//        cout << "进入循环" <<endl;
//    }

//    return 0;
//}
