#! /bin/bash
#==========================================================================================================================
# 3、在exercise3目录下写一个脚本，实现以下目的：
#	a.)对该目录下"1"这个文件去重复，对"2"这个文件每行前5个字符去重复，然后合并输出到"exercise3/result.txt"中
#	b.)将"2"这个文件中含有"hello"的行全部转化为大写后追加输出到"exercise3/result.txt"中
#==========================================================================================================================

#对该目录下"1"这个文件去重复，对"2"这个文件每行前5个字符去重复，然后合并输出到"exercise3/result.txt"中
printf "对1去重复，对2前5个字符去重复：\n" > result.txt
sort -u ./1 >> result.txt
uniq -w 5 ./2 >> result.txt

#将"2"这个文件中含有"hello"的行全部转化为大写后追加输出到"exercise3/result.txt"中
printf "2中含有hello的行转化为大写：\n" >> result.txt
cat ./2 | grep hello |tr a-z A-Z >> result.txt

