#! /bin/bash 
#==========================================================================================================
#   5、在exercise5目录下写一个脚本，对"name"和"age"这两个文本合并（name在前，age在后）然后按数值的方式对第2列排序输出到该目录下"result.txt"中
#==========================================================================================================
printf "显示文件"name"和"age"内容：\n"  > result.txt
cat -n name  >> result.txt
printf "\n" >> result.txt
cat -n age >> result.txt
printf "====================================================================\n" >> result.txt
echo "把"name"和"age"这两个文本合并然后按数值的方式对第2列排序输出：" >> result.txt
paste -d ',' name age | sort -nt ',' -k 2 >> result.txt
exit 0

