#! /bin/bash
#============================================================================================================================================================================================
# 4、在exercise4目录下写一个脚本，实现对"orig.txt"和"new.txt"中不同部分输出到该目录"result.txt"中，然后用tar来实现bzip2亚索打包（注意：后缀名一定要符合通用规范）
#============================================================================================================================================================================================

#比较"orig.txt"和"new.txt"不同部分，输出
echo "左边\"orig.txt\"独有，右边\"new.txt\"独有，\"|\"表示差异行，\"<\"表示\"orig.txt\"多出的行：" > result.txt
echo "" >> result.txt

    diff -y orig.txt new.txt | grep -e "<" -e "|" >> result.txt

#bzip2压缩打包
	tar -cjvf result.tar.bz2 result.txt

exit 0
