#! /bin/bash
#============================================================================================================================
#5、在exercise5目录下写一个脚本，对"name"和"age"这两个文本合并（name在前，age在后）然后按数值的方式对第2列排序输出到该目录下"result.txt"中
#============================================================================================================================
#对"name"和"age"这两个文本合并（name在前，age在后）
echo "name和age合并：" > result.txt
paste -d, name age >> result.txt 
#按数值的方式对第2列排序输出到该目录下"result.txt"中
printf "根据第二列排列后的结果为:" >> result.txt
sort -t ',' -k 2 result.txt  >> result.txt

