#! /bin/bash
#============================================================================================================================================================================================
# 1、在exercise1目录下写一个脚本，除了第一行是#！ /bin/bash以及最后一行是exit 0以外不许超过5行的命令实现以下目的：
#	a.)找出所有后缀名为".txt"的文件（含子目录），然后将其中的内容合并输出到exercise1/result.txt中
#	b.)删除exercise1目录下所有以".log"为后缀名的文件
#	c.)在exercise1目录下创建一个d.txt的文件，权限为777，然后找出所有权限为777的文件并将其内容也输出到exercise1/result.txt中(备注：不得覆盖前面的输出)
#============================================================================================================================================================================================

# a.)找出所有".txt"文件（除了result.txt和d.txt），输出其内容
echo "所有后缀名为\".txt\"的内容：" > result.txt
  
    find -name "*.txt" ! -name "result.txt" ! -name "d.txt" -exec cat {} >> result.txt \;

echo "" >> result.txt

# b.)删除所有".log"文件
    find -name "*.log" -delete

# c.)创建d.txt文件，权限777，找出所有权限777文件，输出其内容
echo "所有权限为777的文件内容：" >> result.txt

    echo "this is content of \"d.txt\"" > d.txt
    chmod 777 d.txt
    find -perm 777 -exec cat {} >> result.txt \;

exit 0

