#ifndef MEASUREDOBJ_H
#define MEASUREDOBJ_H


#include <iostream>

#include "sdk/Shape.hpp"
#include "../sdk/Rectangle.hpp"
#include "../sdk/Circle.hpp"


namespace Job
{
/**
 *  @brief  MeasuredObj
 *          该类表示一个检测对象
 *
 *  @author grace
 *  @version 1.00 2017-11-20 grace
 *                note:create it
 */
class MeasuredObj
{
public:
    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //constructor & destructor

    MeasuredObj();
    /**
     * @brief MeasuredObj 设置测量对象的形状和名字
     * @param pBody 把测量对象的形状设置为pBody
     * @param objName 测量对象的名字设置为objName
     */
    MeasuredObj(SSDK::Shape *pBody,std::string objName);
    virtual ~MeasuredObj();

    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //get & set function

    std::string name() { return this->m_name; }
    void setName(std::string name) { this->m_name = name; }

    SSDK::Shape *pBody() const {return m_pBody;}
    void setPBody(SSDK::Shape *pBody) {m_pBody = pBody;}

    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

protected:
    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //member variant

    std::string m_name{"\0"}; //测量对象名
    SSDK::Shape *m_pBody{nullptr}; //测量对象的形状

    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
};
}//End of namespace Job


#endif // MEASUREDOBJ_H
