#! /bin/bash
#============================================================================================================================================================================================
# 3、在exercise3目录下写一个脚本，实现以下目的：
# 	a.)对该目录下"1"这个文件去重复，对"2"这个文件每行前5个字符去重复，然后合并输出到"exercise3/result.txt"中
# 	b.)将"2"这个文件中含有"hello"的行全部转化为大写后追加输出到"exercise3/result.txt"中
#============================================================================================================================================================================================

# a.)文件1去重，文件2前5个字符去重，合并输出
echo "去重后合并输出：" > result.txt

    echo -e "$(sort -u 1)\n$(uniq -w 5 2)" >> result.txt

echo '' >> result.txt

# b.)文件2中含"hello"的行转大写，输出
echo "追加输出的内容：" >> result.txt

    grep hello 2 | tr a-z A-Z >> result.txt

exit 0

