#! /bin/bash
#============================================================================================================================================================================================
# 6、在exercise6目录下写一个脚本，要实现以下目的
# 		a.) 能够把执行时的参数全部改为大写输出到该目录下result.txt中
#		b.) 根据参数名创建文件，然后文件名不发生变化的情况必须要确保全部是大写
#  		c.) 将文件名最长的那个名称以及该名称有多少个字节追加输出到result.txt中
# 		d.) 最后将该脚本名称全部小写追加输出到该目录下result.txt中
#============================================================================================================================================================================================

# a.) 输入参数，改为大写，输出
echo "执行时的参数名(大写)：" > result.txt

	echo ${*^^} >> result.txt

echo "" >> result.txt

# b.) 根据参数名创建文件
	for filename in ${*^^}
	do 
	  	touch "$filename"
	done

# c.) 输出最长文件名称及字节数
	temp=""
	for var in ${*^^}
	do
	  	if [ ${#var} -gt ${#temp} ]
		then
			temp=$var	
		fi
	done
	echo -e "文件名最长的是：$temp\n其字节数为：$(echo $temp | wc -c)\n" >> result.txt

# d.) 脚本名称小写，输出
	sname=${0##*/}		# 移除目录名
	echo "该脚本名称(小写)：${sname,,}" >> result.txt

exit 0
